In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)

In [4]:
df1 = pd.read_csv("data.csv")
df1.head()

,id,price_tnd,price_eur,location,city,governorate,Area,pieces,room,bathroom,...,garden,concierge,beach_view,mountain_view,pool,elevator,furnished,equipped_kitchen,central_heating,air_conditioning
0,b9e1c759-d149-46e8-9765-d8c198a13ff0,NaN,NaN,Cité El Bassatine Ancien,Boumhel Bassatine,Ben Arous,NaN,27.0,8.0,NaN,...,0,0,0,0,0,0,0,0,0,0
1,863e62e5-0bfe-49f3-ad97-e0ae91be68e9,3250000.0,1007500.0,El Kantaoui,Hammam Sousse,Sousse,1000.0,26.0,16.0,14.0,...,0,1,1,0,0,1,1,1,1,1
2,0048e6da-9aec-4ebe-8ee1-1ad7cd0015e6,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,10.0,...,0,0,0,0,0,0,1,1,1,1
3,032f818f-1b38-4d1a-a000-753e235ccf54,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,NaN,...,0,0,0,0,0,0,1,1,1,1
4,2272576f-fb3b-4c82-8a0e-a00fe2e7c154,2000000.0,620000.0,Sousse Corniche,Sousse Ville,Sousse,932.0,24.0,24.0,10.0,...,0,0,0,0,0,0,1,1,1,1

In [5]:
df1.shape

(8129, 26)

In [7]:
df1.groupby('location')['location'].agg('count')

location
Abou El Kacem Chebbi      4
Aghir                    12
Ain Zaghouan Nord       144
Ain Zaghouan Sud         24
Ajim                      2
                       ...
Zaouit Mornag             1
Zarzis                    5
Zarzouna                  5
Zone Touristique         26
Zone touristique          3
Name: location, Length: 468, dtype: int64

In [12]:
df2 = df1.drop(['pool','elevator','furnished','governorate', 'price_tnd', 'city', 'latt', 'long', 'concierge', 'garden', 'pieces', 'id', 'elevator','air_conditioning', 'equipped_kitchen', 'furnished'], axis='columns')
df2.head()

,price_eur,location,Area,room,bathroom,age,state,distance_to_capital,garage,beach_view,mountain_view,central_heating
0,NaN,Cité El Bassatine Ancien,NaN,8.0,NaN,NaN,NaN,30.815266,0,0,0,0
1,1007500.0,El Kantaoui,1000.0,16.0,14.0,30-50,1.0,108.792932,1,1,0,1
2,620000.0,Sousse Corniche,932.0,24.0,10.0,NaN,1.0,118.317747,0,0,0,1
3,620000.0,Sousse Corniche,932.0,24.0,NaN,NaN,NaN,118.316886,0,0,0,1
4,620000.0,Sousse Corniche,932.0,24.0,10.0,NaN,1.0,118.316886,0,0,0,1

In [13]:
df2.isnull().sum()

price_eur              1708
location                  0
Area                    185
room                    409
bathroom                659
age                    4145
state                  1100
distance_to_capital      35
garage                    0
beach_view                0
mountain_view             0
central_heating           0
dtype: int64

In [14]:
df3 = df2.dropna()
df3.isnull().sum()

price_eur              0
location               0
Area                   0
room                   0
bathroom               0
age                    0
state                  0
distance_to_capital    0
garage                 0
beach_view             0
mountain_view          0
central_heating        0
dtype: int64

In [15]:
df3.shape

(2972, 12)

In [16]:
df3.head()

,price_eur,location,Area,room,bathroom,age,state,distance_to_capital,garage,beach_view,mountain_view,central_heating
1,1007500.0,El Kantaoui,1000.0,16.0,14.0,30-50,1.0,108.792932,1,1,0,1
5,310000.0,Sousse Riadh,1000.0,16.0,9.0,1-5,2.0,119.603211,1,0,0,0
10,620000.0,Kélibia,462.0,12.0,13.0,1-5,2.0,14.249053,0,1,0,1
11,372000.0,Bou Mhel,510.0,14.0,4.0,5-10,1.0,30.815266,1,0,1,1
16,294500.0,El Gourjani,538.0,16.0,5.0,30-50,1.0,2.191132,0,0,0,0

In [20]:
df3[df3.room > 20]

,price_eur,location,Area,room,bathroom,age,state,distance_to_capital,garage,beach_view,mountain_view,central_heating
1384,341000.0,Cité Ettaamir,1420.0,24.0,6.0,1-5,2.0,7.77778,1,0,0,0